In [1]:
pip install pyforest

Requirement already satisfied: pyforest in c:\users\administrator\anaconda3\lib\site-packages (1.1.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.2; however, version 21.3.1 is available.
You should consider upgrading via the 'C:\Users\Administrator\anaconda3\python.exe -m pip install --upgrade pip' command.

In [2]:

import pandas as pd

In [3]:
import numpy as np

In [4]:
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
import scipy as sp

In [6]:
'''
Hello My Name is Syed Noor Mujassum

'''

'\nHello My Name is Syed Noor Mujassum\n\n'

# Python
## Welcome to Python tutorial

#### By
##### Syed Noor Mujassum

- Datatypes
- Functions
- Arrays
- Exception Handling

## Various methods using print

In [7]:
print('Hello')

Hello

In [8]:
print("Syed Noor Mujassum")

Syed Noor Mujassum

In [9]:
first_name = 'Syed Noor'
last_name = 'Mujassum'

In [10]:
print('My first name is {} & and last name is {}.'.format(first_name,last_name))

My first name is Syed Noor & and last name is Mujassum.

In [11]:
print('My first name is {first} and my last name is {last}.'.format(last = last_name, first = first_name))

My first name is Syed Noor and my last name is Mujassum.

In [12]:
len ('Syed Noor Mujassum')

18

# Boolean expressions and operations

In [13]:
string1 = 'Syed Noor Mujassum'

In [14]:
print(string1.isalpha())
print(string1.isalnum())
print(string1.isdigit())
print(string1.islower())
print(string1.istitle())
print(string1.isupper())
print(string1.isprintable())

False
False
False
False
True
False
True

In [15]:
print(True and True)
print(True and False)
print(True or True)
print(True or False)
print(False or False)
print(False and False)

True
False
True
True
False
False

In [16]:
a = True and True

In [17]:
a

True

In [18]:
if (a == "False"):
    
    print('The Output is: 0')

elif (a == "True"):
    print('The Output is: 1')

In [19]:
type([])

list

In [20]:
type(())

tuple

In [21]:
type({})

dict

In [22]:
type(list())

list

In [23]:
my_list = [1,2,3,4,5,'Shabeeb Rabha', 'Mujassum']

In [24]:
my_list

[1, 2, 3, 4, 5, 'Shabeeb Rabha', 'Mujassum']

In [25]:
my_list.append('Rumaysa')

In [26]:
my_list

[1, 2, 3, 4, 5, 'Shabeeb Rabha', 'Mujassum', 'Rumaysa']

In [27]:
my_list.append('Nusayba')

In [28]:
my_list

[1, 2, 3, 4, 5, 'Shabeeb Rabha', 'Mujassum', 'Rumaysa', 'Nusayba']

In [29]:
len(my_list)

9

In [30]:
my_list[6] = 'Sabah'

In [31]:
my_list

[1, 2, 3, 4, 5, 'Shabeeb Rabha', 'Sabah', 'Rumaysa', 'Nusayba']

In [32]:
my_list.append('Ginger')

In [33]:
my_list.append('Coco')

In [34]:
my_list

[1,
 2,
 3,
 4,
 5,
 'Shabeeb Rabha',
 'Sabah',
 'Rumaysa',
 'Nusayba',
 'Ginger',
 'Coco']

In [35]:
family_list  = my_list[5:]
family_list

['Shabeeb Rabha', 'Sabah', 'Rumaysa', 'Nusayba', 'Ginger', 'Coco']

In [36]:
df = pd.DataFrame(family_list, columns=['Names'])
df

           Names
0  Shabeeb Rabha
1          Sabah
2        Rumaysa
3        Nusayba
4         Ginger
5           Coco

#### Inserting a Column in exhisting DataFrame

In [37]:
 df.insert(1, "Relationship", ['Husband','Wife','Daughter','Daughter','Pet','Pet'], True)

In [38]:
df

           Names Relationship
0  Shabeeb Rabha      Husband
1          Sabah         Wife
2        Rumaysa     Daughter
3        Nusayba     Daughter
4         Ginger          Pet
5           Coco          Pet

In [39]:
df.loc[1,["Names"]] = ['Sabah Ebrahim']

In [40]:
df

           Names Relationship
0  Shabeeb Rabha      Husband
1  Sabah Ebrahim         Wife
2        Rumaysa     Daughter
3        Nusayba     Daughter
4         Ginger          Pet
5           Coco          Pet

In [41]:
df.loc[2:3,["Names"]] = ['Rumaysa Fathima','Nusayba Khadija']

In [42]:
df

             Names Relationship
0    Shabeeb Rabha      Husband
1    Sabah Ebrahim         Wife
2  Rumaysa Fathima     Daughter
3  Nusayba Khadija     Daughter
4           Ginger          Pet
5             Coco          Pet

In [43]:
df.loc[4, ["Names", "Relationship"]] = ['Sulaith Rabaita', 'Sister']

In [44]:
df

             Names Relationship
0    Shabeeb Rabha      Husband
1    Sabah Ebrahim         Wife
2  Rumaysa Fathima     Daughter
3  Nusayba Khadija     Daughter
4  Sulaith Rabaita       Sister
5             Coco          Pet

In [45]:
df.loc[5,["Names","Relationship"]] = ['Akmal Mohammed','Brother-in-law']

In [46]:
df.loc[6,["Names","Relationship"]] = ['Mariam Mohammed','Niece']
df.loc[7,["Names","Relationship"]] = ['Sarah Mohammed','Niece']

In [47]:
df

             Names    Relationship
0    Shabeeb Rabha         Husband
1    Sabah Ebrahim            Wife
2  Rumaysa Fathima        Daughter
3  Nusayba Khadija        Daughter
4  Sulaith Rabaita          Sister
5   Akmal Mohammed  Brother-in-law
6  Mariam Mohammed           Niece
7   Sarah Mohammed           Niece

In [48]:
df.loc[8,["Names","Relationship"]] = ['Mohammed Zaheer Ahmed','Father']
df.loc[9,["Names","Relationship"]] = ['Sirajunnisa','Mother']

In [49]:
df

                   Names    Relationship
0          Shabeeb Rabha         Husband
1          Sabah Ebrahim            Wife
2        Rumaysa Fathima        Daughter
3        Nusayba Khadija        Daughter
4        Sulaith Rabaita          Sister
5         Akmal Mohammed  Brother-in-law
6        Mariam Mohammed           Niece
7         Sarah Mohammed           Niece
8  Mohammed Zaheer Ahmed          Father
9            Sirajunnisa          Mother

In [51]:
df.insert(2,"Sex",['Male', 'Female', 'Female', 'Female', 'Female', 'Male', 'Female','Female','Male','Female'])
df

                   Names    Relationship     Sex
0          Shabeeb Rabha         Husband    Male
1          Sabah Ebrahim            Wife  Female
2        Rumaysa Fathima        Daughter  Female
3        Nusayba Khadija        Daughter  Female
4        Sulaith Rabaita          Sister  Female
5         Akmal Mohammed  Brother-in-law    Male
6        Mariam Mohammed           Niece  Female
7         Sarah Mohammed           Niece  Female
8  Mohammed Zaheer Ahmed          Father    Male
9            Sirajunnisa          Mother  Female

In [52]:
df.insert(3,"Location",['Bengaluru', 'Bengaluru', 'Bengaluru', 'Bengaluru', 'Kuwait', 'Kuwait', 'Kuwait','Kuwait','Bengaluru','Bengaluru'])
df

                   Names    Relationship     Sex   Location
0          Shabeeb Rabha         Husband    Male  Bengaluru
1          Sabah Ebrahim            Wife  Female  Bengaluru
2        Rumaysa Fathima        Daughter  Female  Bengaluru
3        Nusayba Khadija        Daughter  Female  Bengaluru
4        Sulaith Rabaita          Sister  Female     Kuwait
5         Akmal Mohammed  Brother-in-law    Male     Kuwait
6        Mariam Mohammed           Niece  Female     Kuwait
7         Sarah Mohammed           Niece  Female     Kuwait
8  Mohammed Zaheer Ahmed          Father    Male  Bengaluru
9            Sirajunnisa          Mother  Female  Bengaluru

In [56]:
new_list = [200,100,300,'abc','def',900]

In [57]:
new_list

[200, 100, 300, 'abc', 'def', 900]

In [58]:
new_list.append('syed')

In [59]:
new_list

[200, 100, 300, 'abc', 'def', 900, 'syed']

In [60]:
new_list[5]

900

In [61]:
len(new_list)

7

In [70]:
new_list[-1]

'syed'

In [71]:
new_list[-4]

'abc'

### .insert()
- It is used to add a value to the list in any order or particular index

In [72]:
new_list.insert(2,'Hippo')

In [73]:
new_list

[200, 100, 'Hippo', 300, 'abc', 'def', 900, 'syed']

In [83]:
new_list[:-2]

[200, 100, 'Hippo', 300, 'abc', 'def']

#### .append() 
- It is used to add a value to a list, it adds values in the end of the list.

In [84]:
new_list

[200, 100, 'Hippo', 300, 'abc', 'def', 900, 'syed']

In [85]:
new_list.append('pink')

In [86]:
new_list

[200, 100, 'Hippo', 300, 'abc', 'def', 900, 'syed', 'pink']

### .extend()
- It is used to add value to the list without getting added the values as nested list

In [89]:
# example for append vs extend

new_list = [200, 100, 'Hippo', 300, 'abc', 'def', 900, 'syed', 'pink']

In [90]:
new_list

[200, 100, 'Hippo', 300, 'abc', 'def', 900, 'syed', 'pink']

In [91]:
new_list.append(['12','13'])
new_list

[200, 100, 'Hippo', 300, 'abc', 'def', 900, 'syed', 'pink', ['12', '13']]

In [92]:
new_list.extend(['14','15'])
new_list

[200,
 100,
 'Hippo',
 300,
 'abc',
 'def',
 900,
 'syed',
 'pink',
 ['12', '13'],
 '14',
 '15']

As you can see that in extend the values are taken as normal value to the list and where as in .append the values were taken as nested list

# Various Operations performed on list

In [95]:
list2 = [1,2,3,4,5,6,7,8,9,10]
list2

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

### sum() operator
- It adds all the values of a list and gives the result

In [96]:
sum(list2)

55

### .pop() operator
- It will by default remove last value of the list 
- If given any index value then that position value will be removed

In [97]:
list2.pop()

10

In [98]:
list2

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [99]:
list2.pop(4)

5

In [100]:
list2

[1, 2, 3, 4, 6, 7, 8, 9]

### .count()
- It will count the number of occurences of a given value in list

In [103]:
l3 = [1,1,2,3,4,5,5,5,5,5,5,5,5,6,7,8,9,9,9,8,8,8,9,9,9,9,4,4,4,4,44,4,44,4,4,4,4,4,4,4,4,4,4,4,4]

In [104]:
l3.count(3)

1

In [105]:
l3.count(44)

2

In [106]:
l3.count(4)

18

In [107]:
l3.count(5)

8

### .index()
- It returns the index of the first occurence.
- Start and End index values are not mandatory.

In [108]:
l3

[1,
 1,
 2,
 3,
 4,
 5,
 5,
 5,
 5,
 5,
 5,
 5,
 5,
 6,
 7,
 8,
 9,
 9,
 9,
 8,
 8,
 8,
 9,
 9,
 9,
 9,
 4,
 4,
 4,
 4,
 44,
 4,
 44,
 4,
 4,
 4,
 4,
 4,
 4,
 4,
 4,
 4,
 4,
 4,
 4]

In [110]:
l3.index(1,1,6)

1

In [118]:
l3.index(44,0,100)

30

### len()
- It returns length of a list

In [120]:
len(l3)

45

### min() and max() 
- They return the minimum and maximum values present in the list

In [131]:
minimum = min(l3)
print ("The Minimum value present in the list l3 is : '{}'".format(minimum))

The Minimum value present in the list l3 is : '1'

In [132]:
maximum = max(l3)
print ("The Maximum value present in the list l3 is :'{}' ".format(maximum) )

The Maximum value present in the list l3 is :'44'

## SETS
- It is a collection of unordered data types which are iterable, mutable and has no duplicates. (It is based on data structure known as Hash Table)

In [134]:
# Creating an empty Set

new_set = set()
print(new_set)

set()

In [136]:
type_set = type(new_set)
print("The type of the set defined is {}.".format(type_set))

The type of the set defined is <class 'set'>.

In [138]:
new_set = {'a','b','c','d','a','b'}
new_set

{'a', 'b', 'c', 'd'}

As you can see that the set does not contain duplicate values

In [139]:
new_set = {'Abdul', 'Sana','Rahul', 'Raj','Ankita'}

In [140]:
new_set

{'Abdul', 'Ankita', 'Rahul', 'Raj', 'Sana'}

In [141]:
type(new_set)

set

In [142]:
# Indexing in Sets
new_set[0]

TypeError: 'set' object is not subscriptable

As seen above Sets does not support Indexing

In [143]:
# Subscripting in Sets
new_set['Ankita']

TypeError: 'set' object is not subscriptable

Sets are not subscriptable

#### Note:
- There are different methods for subrcripting and indexing of sets which is discussed later

## Inbuilt methods or functions associated with sets
- .add
- .difference
- .difference_update etc

In [144]:
new_set

{'Abdul', 'Ankita', 'Rahul', 'Raj', 'Sana'}

In [145]:
new_set.add('Pavan')
new_set

{'Abdul', 'Ankita', 'Pavan', 'Rahul', 'Raj', 'Sana'}

In [160]:
set2=set()
set2 = {'Abdul','Sana','Pavan','Raj'}

In [161]:
# new_set-set2 
new_set.difference(set2)

{'Ankita', 'Rahul'}

In [162]:
new_set

{'Ankita', 'Rahul'}

In [163]:
# Now the new_set will be updated as well
new_set.difference_update(set2)

In [164]:
new_set

{'Ankita', 'Rahul'}

In [169]:
new_set.add('Mujassum')

In [170]:
# Like wise lets check intersection and intersection_update
set2.add('Mujassum')
set2

{'Abdul', 'Mujassum', 'Pavan', 'Raj', 'Sana'}

In [171]:
type(set2)

set

In [172]:
new_set

{'Ankita', 'Mujassum', 'Rahul'}

In [173]:
set2.intersection(new_set)

{'Mujassum'}

In [174]:
set2

{'Abdul', 'Mujassum', 'Pavan', 'Raj', 'Sana'}

In [175]:
set2.intersection_update(new_set)

In [176]:
set2

{'Mujassum'}

# Dictionaries
### it is a collection of keyvalue pairs which is mutable and indexed
- The difference in sets and dictionaries is, in dictionary it is defined by empty curly braces
- whereas sets we pass the values in curly braces like 1,2,3,a,ab etc.
- In dictionary the values are added in key-value pairs like {"car" : "BMW", "name" : "syed"} etc.

In [177]:
dic = {}
type(dic)

dict

In [178]:
dic2 = {'1','a','ab'}
type(dic2)

set

In [179]:
dic3={"Name":"Syed","Gender":"M","Nationality":"India"}
dic3

{'Name': 'Syed', 'Gender': 'M', 'Nationality': 'India'}

In [180]:
type(dic3)

dict

### Note: 
- In dictionaries the indexing is done by key value not index number

In [181]:
dic3

{'Name': 'Syed', 'Gender': 'M', 'Nationality': 'India'}

In [184]:
dic3['Name']

'Syed'

In [185]:
# using for loops for accessing dictionary (default it shall take the keys)

for x in dic3:
    print(x)

Name
Gender
Nationality

In [187]:
for x in dic3.values():
    print(x)

Syed
M
India

In [195]:
for x in dic3.items():
    print( x)

('Name', 'Syed')
('Gender', 'M')
('Nationality', 'India')

In [196]:
# Adding new entries to the dictionary
dic3['Ethnicity']= 'South-East Asian'

In [197]:
dic3

{'Name': 'Syed',
 'Gender': 'M',
 'Nationality': 'India',
 'Ethnicity': 'South-East Asian'}

## Nested Dictionaries

In [198]:
car1_model = {'BMW':2004}
car2_model = {'Mercedes':2007}
car3_model = {'Audi':2011}

cars = {'car1':car1_model,'car2':car2_model,'car3':'car3_model'}

In [199]:
cars

{'car1': {'BMW': 2004}, 'car2': {'Mercedes': 2007}, 'car3': 'car3_model'}

In [200]:
cars['car3'] = car3_model

In [201]:
cars

{'car1': {'BMW': 2004}, 'car2': {'Mercedes': 2007}, 'car3': {'Audi': 2011}}

In [204]:
print(cars['car1'])

{'BMW': 2004}

In [205]:
print (cars['car2'])

{'Mercedes': 2007}

In [206]:
print(cars['car3'])

{'Audi': 2011}

In [207]:
print(cars['car2']['Mercedes'])

2007

In [210]:
for x in cars.items():
    print(x)

('car1', {'BMW': 2004})
('car2', {'Mercedes': 2007})
('car3', {'Audi': 2011})

### Tuples
- tuples are defined by () and they are not mutable i,e the whole tuple can be changed but a single element cannot be changed in tuple
- there are 2 in-built functions of tuple:
                1. index - to find index of a element
                2. count - to find counts of a element

In [211]:
tup = tuple()
tup

()

In [212]:
tup = ('1','a','33')

In [213]:
tup

('1', 'a', '33')

In [214]:
type(tup)

tuple

In [216]:
tup[0] = ('23')

TypeError: 'tuple' object does not support item assignment

In [217]:
tup.count('a')

1

In [218]:
tup.index('33')

2

In [226]:
first_name = 'Afeera'
last_name = 'Sana'
name = first_name + ' ' + last_name

In [227]:
print (name)

Afeera Sana

In [234]:
print ("1. Afeera Sana")
print ("2. {} {}".format(first_name,last_name))
print ("3. {First} {Last}".format(First = first_name, Last = last_name))
print("4. {name}".format(name=name))
print ("5.",name)

1. Afeera Sana
2. Afeera Sana
3. Afeera Sana
4. Afeera Sana
5. Afeera Sana